<a href="https://colab.research.google.com/github/oliver22-2/Senai-Python/blob/main/Atv9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import statistics as st

In [2]:
# Crie uma Series chamada temperaturas com os valores:
# [22, 25, 19, 28, 23] e índices ['Seg', 'Ter', 'Qua', 'Qui', 'Sex'].
# Exiba a Series completa

temperaturas = pd.Series([22, 25, 19, 28, 23], index=['Seg', 'Ter', 'Qua', 'Qui', 'Sex'])
temperaturas

Seg    22
Ter    25
Qua    19
Qui    28
Sex    23
dtype: int64

In [3]:
# Acesse e exiba o valor da temperatura de 'Qua'.
# Acesse e exiba os valores de temperatura dos dias 'Seg' e 'Sex'.

temperaturas.iloc[0:5:2]

Seg    22
Qua    19
Sex    23
dtype: int64

In [4]:
# Manipulação de Valores em Series:
# Altere a temperatura de 'Ter' para 26. Exiba a Series após a alteração.
# Multiplique todos os valores da Series por 1.5. Exiba o resultado.

temperaturas['Ter']=26
print(temperaturas)

Seg    22
Ter    26
Qua    19
Qui    28
Sex    23
dtype: int64

In [ ]:
temperaturas2=temperaturas*1.5
print(temperaturas2)

In [5]:
# Filtragem e Nulos em Series:
# Exiba apenas as temperaturas que são maiores que 24.
# Crie uma nova Series chamada estoque com os valores:
# [100, 150, np.nan, 80, 120] e índices:
# ['Produto A', 'Produto B', 'Produto C', 'Produto D', 'Produto E'].
# Verifique e exiba quais elementos da Series estoque são nulos.

temperaturas3=temperaturas[temperaturas>24]
temperaturas3

Ter    26
Qui    28
dtype: int64

In [6]:
estoque = pd.Series([100, 150, np.nan, 80, 120], index=['Produto A', 'Produto B', 'Produto C', 'Produto D', 'Produto E'])
estoque

Produto A    100.0
Produto B    150.0
Produto C      NaN
Produto D     80.0
Produto E    120.0
dtype: float64

In [7]:
estoque.isnull()

Produto A    False
Produto B    False
Produto C     True
Produto D    False
Produto E    False
dtype: bool